# Определить, позицию второго вхождения строки в списке либо сообщить, что её нет.
# Примеры
# список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# список: [], ищем: "123", ответ: -1

list_str = ["йцу", "фыв", "ячс", "цук", "йцукен"]
print(f"Список: {list_str}")
item = input("Введите строку: ")


def check(list_str, item):
    count = 0
    for i in range(len(list_str)):
        if list_str[i] == item:
            count += 1
            if count == 2:
                return i
    else:
        return -1


print(f"Oтвет: {check(list_str, item)}")


# ==================